grevaillot/svd_tools/headers/STM32F407/otg_hs_device.h
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_NAK NAK interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_NAK		(1 << 13)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_BERR Babble error interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_BERR		(1 << 12)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_PKTDRPSTS Packet dropped status **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_PKTDRPSTS		(1 << 11)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_BNA Buffer not available interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_BNA		(1 << 9)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_TXFIFOUDRN Transmit Fifo Underrun **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_TXFIFOUDRN		(1 << 8)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_TXFE Transmit FIFO empty **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_TXFE		(1 << 7)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_INEPNE IN endpoint NAK effective **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_INEPNE		(1 << 6)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_ITTXFE IN token received when TxFIFO is empty **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_ITTXFE		(1 << 4)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_TOC Timeout condition **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_TOC		(1 << 3)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_EPDISD Endpoint disabled interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_EPDISD		(1 << 1)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT0_XFRC Transfer completed interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT0_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_device_otg_hs_dieptsiz0 OTGHSDIEPTSIZ0 OTG_HS device IN endpoint 0 transfer size register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ0_PKTCNT_SHIFT		19
#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ0_PKTCNT_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_dieptsiz0_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ0_XFRSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ0_XFRSIZ_MASK		0x7f
/** @defgroup otg_hs_device_otg_hs_dieptsiz0_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepdma1 OTGHSDIEPDMA1 OTG_HS device endpoint-1 DMA address register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DIEPDMA1_DMAADDR_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DIEPDMA1_DMAADDR_MASK		0xffffffff
/** @defgroup otg_hs_device_otg_hs_diepdma1_dmaaddr DMAADDR DMA address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_dtxfsts0 OTGHSDTXFSTS0 OTG_HS device IN endpoint transmit FIFO status register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DTXFSTS0_INEPTFSAV_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DTXFSTS0_INEPTFSAV_MASK		0xffff
/** @defgroup otg_hs_device_otg_hs_dtxfsts0_ineptfsav INEPTFSAV IN endpoint TxFIFO space avail
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepctl1 OTGHSDIEPCTL1 OTG device endpoint-1 control register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL1_EPENA Endpoint enable **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL1_EPENA		(1 << 31)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL1_EPDIS Endpoint disable **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL1_EPDIS		(1 << 30)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL1_SODDFRM Set odd frame **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL1_SODDFRM		(1 << 29)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL1_SD0PID_SEVNFRM Set DATA0 PID **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL1_SD0PID_SEVNFRM		(1 << 28)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL1_SNAK Set NAK **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL1_SNAK		(1 << 27)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL1_CNAK Clear NAK **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL1_CNAK		(1 << 26)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL1_TXFNUM_SHIFT		22
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL1_TXFNUM_MASK		0x0f
/** @defgroup otg_hs_device_otg_hs_diepctl1_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL1_Stall STALL handshake **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL1_Stall		(1 << 21)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL1_EPTYP_SHIFT		18
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL1_EPTYP_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_diepctl1_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL1_NAKSTS NAK status **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL1_NAKSTS		(1 << 17)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL1_EONUM_DPID Even/odd frame **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL1_EONUM_DPID		(1 << 16)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL1_USBAEP USB active endpoint **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL1_USBAEP		(1 << 15)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL1_MPSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL1_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_device_otg_hs_diepctl1_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepint1 OTGHSDIEPINT1 OTG device endpoint-1 interrupt register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DIEPINT1_NAK NAK interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT1_NAK		(1 << 13)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT1_BERR Babble error interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT1_BERR		(1 << 12)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT1_PKTDRPSTS Packet dropped status **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT1_PKTDRPSTS		(1 << 11)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT1_BNA Buffer not available interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT1_BNA		(1 << 9)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT1_TXFIFOUDRN Transmit Fifo Underrun **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT1_TXFIFOUDRN		(1 << 8)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT1_TXFE Transmit FIFO empty **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT1_TXFE		(1 << 7)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT1_INEPNE IN endpoint NAK effective **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT1_INEPNE		(1 << 6)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT1_ITTXFE IN token received when TxFIFO is empty **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT1_ITTXFE		(1 << 4)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT1_TOC Timeout condition **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT1_TOC		(1 << 3)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT1_EPDISD Endpoint disabled interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT1_EPDISD		(1 << 1)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT1_XFRC Transfer completed interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT1_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_device_otg_hs_dieptsiz1 OTGHSDIEPTSIZ1 OTG_HS device endpoint transfer size register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ1_MCNT_SHIFT		29
#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ1_MCNT_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_dieptsiz1_mcnt MCNT Multi count
@{*/
/**@}*/


