grevaillot/svd_tools/headers/STM32F407/otg_hs_device.h
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL5_Stall STALL handshake **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_Stall		(1 << 21)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_EPTYP_SHIFT		18
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_EPTYP_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_diepctl5_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL5_NAKSTS NAK status **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_NAKSTS		(1 << 17)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL5_EONUM_DPID Even/odd frame **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_EONUM_DPID		(1 << 16)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL5_USBAEP USB active endpoint **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_USBAEP		(1 << 15)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_MPSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL5_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_device_otg_hs_diepctl5_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepint5 OTGHSDIEPINT5 OTG device endpoint-5 interrupt register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_NAK NAK interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_NAK		(1 << 13)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_BERR Babble error interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_BERR		(1 << 12)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_PKTDRPSTS Packet dropped status **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_PKTDRPSTS		(1 << 11)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_BNA Buffer not available interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_BNA		(1 << 9)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_TXFIFOUDRN Transmit Fifo Underrun **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_TXFIFOUDRN		(1 << 8)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_TXFE Transmit FIFO empty **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_TXFE		(1 << 7)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_INEPNE IN endpoint NAK effective **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_INEPNE		(1 << 6)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_ITTXFE IN token received when TxFIFO is empty **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_ITTXFE		(1 << 4)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_TOC Timeout condition **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_TOC		(1 << 3)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_EPDISD Endpoint disabled interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_EPDISD		(1 << 1)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT5_XFRC Transfer completed interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT5_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_device_otg_hs_dieptsiz5 OTGHSDIEPTSIZ5 OTG_HS device endpoint transfer size register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ5_MCNT_SHIFT		29
#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ5_MCNT_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_dieptsiz5_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ5_PKTCNT_SHIFT		19
#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ5_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_device_otg_hs_dieptsiz5_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ5_XFRSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DIEPTSIZ5_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_hs_device_otg_hs_dieptsiz5_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_dtxfsts5 OTGHSDTXFSTS5 OTG_HS device IN endpoint transmit FIFO status register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DTXFSTS5_INEPTFSAV_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DTXFSTS5_INEPTFSAV_MASK		0xffff
/** @defgroup otg_hs_device_otg_hs_dtxfsts5_ineptfsav INEPTFSAV IN endpoint TxFIFO space avail
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepctl6 OTGHSDIEPCTL6 OTG device endpoint-6 control register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL6_EPENA Endpoint enable **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL6_EPENA		(1 << 31)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL6_EPDIS Endpoint disable **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL6_EPDIS		(1 << 30)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL6_SODDFRM Set odd frame **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL6_SODDFRM		(1 << 29)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL6_SD0PID_SEVNFRM Set DATA0 PID **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL6_SD0PID_SEVNFRM		(1 << 28)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL6_SNAK Set NAK **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL6_SNAK		(1 << 27)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL6_CNAK Clear NAK **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL6_CNAK		(1 << 26)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL6_TXFNUM_SHIFT		22
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL6_TXFNUM_MASK		0x0f
/** @defgroup otg_hs_device_otg_hs_diepctl6_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL6_Stall STALL handshake **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL6_Stall		(1 << 21)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL6_EPTYP_SHIFT		18
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL6_EPTYP_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_diepctl6_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL6_NAKSTS NAK status **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL6_NAKSTS		(1 << 17)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL6_EONUM_DPID Even/odd frame **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL6_EONUM_DPID		(1 << 16)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL6_USBAEP USB active endpoint **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL6_USBAEP		(1 << 15)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL6_MPSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL6_MPSIZ_MASK		0x7ff
/** @defgroup otg_hs_device_otg_hs_diepctl6_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepint6 OTGHSDIEPINT6 OTG device endpoint-6 interrupt register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DIEPINT6_NAK NAK interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT6_NAK		(1 << 13)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT6_BERR Babble error interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT6_BERR		(1 << 12)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT6_PKTDRPSTS Packet dropped status **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT6_PKTDRPSTS		(1 << 11)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT6_BNA Buffer not available interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT6_BNA		(1 << 9)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT6_TXFIFOUDRN Transmit Fifo Underrun **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT6_TXFIFOUDRN		(1 << 8)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT6_TXFE Transmit FIFO empty **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT6_TXFE		(1 << 7)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT6_INEPNE IN endpoint NAK effective **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT6_INEPNE		(1 << 6)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT6_ITTXFE IN token received when TxFIFO is empty **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT6_ITTXFE		(1 << 4)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT6_TOC Timeout condition **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT6_TOC		(1 << 3)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT6_EPDISD Endpoint disabled interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT6_EPDISD		(1 << 1)
/** OTG_HS_DEVICE_OTG_HS_DIEPINT6_XFRC Transfer completed interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DIEPINT6_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_device_otg_hs_diepctl7 OTGHSDIEPCTL7 OTG device endpoint-7 control register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL7_EPENA Endpoint enable **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_EPENA		(1 << 31)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL7_EPDIS Endpoint disable **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_EPDIS		(1 << 30)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL7_SODDFRM Set odd frame **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_SODDFRM		(1 << 29)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL7_SD0PID_SEVNFRM Set DATA0 PID **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_SD0PID_SEVNFRM		(1 << 28)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL7_SNAK Set NAK **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_SNAK		(1 << 27)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL7_CNAK Clear NAK **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_CNAK		(1 << 26)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_TXFNUM_SHIFT		22
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_TXFNUM_MASK		0x0f
/** @defgroup otg_hs_device_otg_hs_diepctl7_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL7_Stall STALL handshake **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_Stall		(1 << 21)

#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_EPTYP_SHIFT		18
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_EPTYP_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_diepctl7_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_HS_DEVICE_OTG_HS_DIEPCTL7_NAKSTS NAK status **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_NAKSTS		(1 << 17)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL7_EONUM_DPID Even/odd frame **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_EONUM_DPID		(1 << 16)
/** OTG_HS_DEVICE_OTG_HS_DIEPCTL7_USBAEP USB active endpoint **/
#define OTG_HS_DEVICE_OTG_HS_DIEPCTL7_USBAEP		(1 << 15)

