grevaillot/svd_tools/headers/STM32F407/otg_hs_device.h
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT_SHIFT		29
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ3_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_doeptsiz3_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT_SHIFT		19
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ3_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_device_otg_hs_doeptsiz3_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ3_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_hs_device_otg_hs_doeptsiz3_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_doepint4 OTGHSDOEPINT4 OTG_HS device endpoint-4 interrupt register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DOEPINT4_NYET NYET interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT4_NYET		(1 << 14)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT4_B2BSTUP Back-to-back SETUP packets received **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT4_B2BSTUP		(1 << 6)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT4_OTEPDIS OUT token received when endpoint disabled **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT4_OTEPDIS		(1 << 4)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT4_STUP SETUP phase done **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT4_STUP		(1 << 3)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT4_EPDISD Endpoint disabled interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT4_EPDISD		(1 << 1)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT4_XFRC Transfer completed interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT4_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_device_otg_hs_doeptsiz4 OTGHSDOEPTSIZ4 OTG_HS device endpoint-5 transfer size register
@{*/


#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT_SHIFT		29
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ4_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg_hs_device_otg_hs_doeptsiz4_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ4_PKTCNT_SHIFT		19
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ4_PKTCNT_MASK		0x3ff
/** @defgroup otg_hs_device_otg_hs_doeptsiz4_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ4_XFRSIZ_SHIFT		0
#define OTG_HS_DEVICE_OTG_HS_DOEPTSIZ4_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_hs_device_otg_hs_doeptsiz4_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_hs_device_otg_hs_doepint5 OTGHSDOEPINT5 OTG_HS device endpoint-5 interrupt register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DOEPINT5_NYET NYET interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT5_NYET		(1 << 14)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT5_B2BSTUP Back-to-back SETUP packets received **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT5_B2BSTUP		(1 << 6)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT5_OTEPDIS OUT token received when endpoint disabled **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT5_OTEPDIS		(1 << 4)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT5_STUP SETUP phase done **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT5_STUP		(1 << 3)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT5_EPDISD Endpoint disabled interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT5_EPDISD		(1 << 1)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT5_XFRC Transfer completed interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT5_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_device_otg_hs_doepint6 OTGHSDOEPINT6 OTG_HS device endpoint-6 interrupt register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DOEPINT6_NYET NYET interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT6_NYET		(1 << 14)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT6_B2BSTUP Back-to-back SETUP packets received **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT6_B2BSTUP		(1 << 6)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT6_OTEPDIS OUT token received when endpoint disabled **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT6_OTEPDIS		(1 << 4)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT6_STUP SETUP phase done **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT6_STUP		(1 << 3)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT6_EPDISD Endpoint disabled interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT6_EPDISD		(1 << 1)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT6_XFRC Transfer completed interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT6_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_hs_device_otg_hs_doepint7 OTGHSDOEPINT7 OTG_HS device endpoint-7 interrupt register
@{*/

/** OTG_HS_DEVICE_OTG_HS_DOEPINT7_NYET NYET interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT7_NYET		(1 << 14)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT7_B2BSTUP Back-to-back SETUP packets received **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT7_B2BSTUP		(1 << 6)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT7_OTEPDIS OUT token received when endpoint disabled **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT7_OTEPDIS		(1 << 4)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT7_STUP SETUP phase done **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT7_STUP		(1 << 3)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT7_EPDISD Endpoint disabled interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT7_EPDISD		(1 << 1)
/** OTG_HS_DEVICE_OTG_HS_DOEPINT7_XFRC Transfer completed interrupt **/
#define OTG_HS_DEVICE_OTG_HS_DOEPINT7_XFRC		(1 << 0)

/**@}*/
